In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'A':[1,2,np.nan],
                   'B':[4,np.nan,np.nan],
                   'C':[7,8,9]})

In [3]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [4]:
df.dropna()

     A    B  C
0  1.0  4.0  7

In [5]:
df.dropna(axis=1)

   C
0  7
1  8
2  9

In [6]:
df.fillna(value='Kosong')

        A       B  C
0       1       4  7
1       2  Kosong  8
2  Kosong  Kosong  9

In [7]:
df['A'].fillna(value=df['A'].mean(), inplace=True)

In [8]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  1.5  NaN  9

In [9]:
df['B'].fillna(value=df['B'].mean(), inplace=True)

In [10]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  4.0  8
2  1.5  4.0  9